# Loading libraries

In [2]:
import numpy as np
import pandas as pd

# Object creation

### Creating a Series by passing a list of values, letting pandas create a default integer index:

In [76]:
s = pd.Series([1,3, 4, np.nan, 6,8])
s

0    1.0
1    3.0
2    4.0
3    NaN
4    6.0
5    8.0
dtype: float64

### Creating a DataFrame by passing a Numpy array, which a datetime index and labeled columns:

In [77]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [78]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.554931  1.068021  0.151068 -1.115212
2013-01-02 -0.567171 -0.856653  0.000226  2.131702
2013-01-03  0.773102  0.078984 -1.731036  0.420933
2013-01-04  0.522558 -1.593280 -0.158449 -1.632815
2013-01-05  0.013442  0.175822  0.696630  0.423300
2013-01-06 -1.204969  0.445324 -0.357431 -2.375015

### Creating a DataFrame by passing a dict of objects that can be converted to series-like:

In [79]:
df2 = pd.DataFrame(
    {
        "A":1.0,
        "B":pd.Timestamp("20210324"),
        "C":pd.Series(1, index=list(range(4)), dtype="float32"),
        "D":np.array([3]*4, dtype="int32"),
        "E":pd.Categorical(["test", "train", "test", "train"]),
        "F":"foo"
    }
)
df2

     A          B    C  D      E    F
0  1.0 2021-03-24  1.0  3   test  foo
1  1.0 2021-03-24  1.0  3  train  foo
2  1.0 2021-03-24  1.0  3   test  foo
3  1.0 2021-03-24  1.0  3  train  foo

### The columns of the resulting DataFrame have different dtypes:

In [80]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# Viewing data

In [81]:
df.head()

                   A         B         C         D
2013-01-01 -0.554931  1.068021  0.151068 -1.115212
2013-01-02 -0.567171 -0.856653  0.000226  2.131702
2013-01-03  0.773102  0.078984 -1.731036  0.420933
2013-01-04  0.522558 -1.593280 -0.158449 -1.632815
2013-01-05  0.013442  0.175822  0.696630  0.423300

In [82]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.522558 -1.593280 -0.158449 -1.632815
2013-01-05  0.013442  0.175822  0.696630  0.423300
2013-01-06 -1.204969  0.445324 -0.357431 -2.375015

In [83]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [84]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [85]:
df.to_numpy()

array([[-5.54930824e-01,  1.06802140e+00,  1.51068490e-01,
        -1.11521155e+00],
       [-5.67171017e-01, -8.56653340e-01,  2.26464050e-04,
         2.13170206e+00],
       [ 7.73101858e-01,  7.89843031e-02, -1.73103568e+00,
         4.20933224e-01],
       [ 5.22557501e-01, -1.59327965e+00, -1.58448598e-01,
        -1.63281517e+00],
       [ 1.34420396e-02,  1.75822245e-01,  6.96630249e-01,
         4.23299624e-01],
       [-1.20496947e+00,  4.45323561e-01, -3.57431341e-01,
        -2.37501527e+00]])

In [86]:
df2.to_numpy()

array([[1.0, Timestamp('2021-03-24 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2021-03-24 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2021-03-24 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2021-03-24 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [87]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.169662 -0.113630 -0.233165 -0.357851
std    0.745628  0.956144  0.816244  1.654246
min   -1.204969 -1.593280 -1.731036 -2.375015
25%   -0.564111 -0.622744 -0.307686 -1.503414
50%   -0.270744  0.127403 -0.079111 -0.347139
75%    0.395279  0.377948  0.113358  0.422708
max    0.773102  1.068021  0.696630  2.131702

In [88]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.554931   -0.567171    0.773102    0.522558    0.013442   -1.204969
B    1.068021   -0.856653    0.078984   -1.593280    0.175822    0.445324
C    0.151068    0.000226   -1.731036   -0.158449    0.696630   -0.357431
D   -1.115212    2.131702    0.420933   -1.632815    0.423300   -2.375015

### Sorting by axis:

In [89]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.115212  0.151068  1.068021 -0.554931
2013-01-02  2.131702  0.000226 -0.856653 -0.567171
2013-01-03  0.420933 -1.731036  0.078984  0.773102
2013-01-04 -1.632815 -0.158449 -1.593280  0.522558
2013-01-05  0.423300  0.696630  0.175822  0.013442
2013-01-06 -2.375015 -0.357431  0.445324 -1.204969

### Sorting by values:

In [90]:
df.sort_values(by="B", ascending=False)

                   A         B         C         D
2013-01-01 -0.554931  1.068021  0.151068 -1.115212
2013-01-06 -1.204969  0.445324 -0.357431 -2.375015
2013-01-05  0.013442  0.175822  0.696630  0.423300
2013-01-03  0.773102  0.078984 -1.731036  0.420933
2013-01-02 -0.567171 -0.856653  0.000226  2.131702
2013-01-04  0.522558 -1.593280 -0.158449 -1.632815

# Selection

## Getting

### Selecting a single column, which yields a Series, equivalent to df.A:

In [91]:
df["A"]

2013-01-01   -0.554931
2013-01-02   -0.567171
2013-01-03    0.773102
2013-01-04    0.522558
2013-01-05    0.013442
2013-01-06   -1.204969
Freq: D, Name: A, dtype: float64

### Selecting via [ ], which slices the rows

In [92]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.554931  1.068021  0.151068 -1.115212
2013-01-02 -0.567171 -0.856653  0.000226  2.131702
2013-01-03  0.773102  0.078984 -1.731036  0.420933

In [93]:
df["2013-01-05":"2013-01-07"]

                   A         B         C         D
2013-01-05  0.013442  0.175822  0.696630  0.423300
2013-01-06 -1.204969  0.445324 -0.357431 -2.375015

## Selection by label

In [94]:
df

                   A         B         C         D
2013-01-01 -0.554931  1.068021  0.151068 -1.115212
2013-01-02 -0.567171 -0.856653  0.000226  2.131702
2013-01-03  0.773102  0.078984 -1.731036  0.420933
2013-01-04  0.522558 -1.593280 -0.158449 -1.632815
2013-01-05  0.013442  0.175822  0.696630  0.423300
2013-01-06 -1.204969  0.445324 -0.357431 -2.375015

In [95]:
df.loc[dates[0]]

A   -0.554931
B    1.068021
C    0.151068
D   -1.115212
Name: 2013-01-01 00:00:00, dtype: float64

### Selecting on multi-axis label:

In [96]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01 -0.554931  1.068021
2013-01-02 -0.567171 -0.856653
2013-01-03  0.773102  0.078984
2013-01-04  0.522558 -1.593280
2013-01-05  0.013442  0.175822
2013-01-06 -1.204969  0.445324

### Showing label slicing, both endpoints are included:

In [97]:
df.loc["20130102":"20130104",["A","B"]]

                   A         B
2013-01-02 -0.567171 -0.856653
2013-01-03  0.773102  0.078984
2013-01-04  0.522558 -1.593280

Reduction in the dimensions of the returned object:

In [98]:
df.loc["20130102",["A","B"]]

A   -0.567171
B   -0.856653
Name: 2013-01-02 00:00:00, dtype: float64

### For getting a scalar value:

In [99]:
df.loc[dates[0], "A"]

-0.5549308242831619

### For getting fast access to a scalar (equivalent to the prior method):

In [100]:
df.at[dates[0], "A"]

-0.5549308242831619

## Selection by position

### Select via the position of the passed integers:

In [101]:
df.iloc[3]

A    0.522558
B   -1.593280
C   -0.158449
D   -1.632815
Name: 2013-01-04 00:00:00, dtype: float64

### By integer slices, acting similar to numpy/Python:

In [102]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.522558 -1.593280
2013-01-05  0.013442  0.175822

### By lists of interger position locations, similar to the Numpy/Python style:

In [103]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.567171  0.000226
2013-01-03  0.773102 -1.731036
2013-01-05  0.013442  0.696630

### For slicing rows explicitly:

In [104]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.567171 -0.856653  0.000226  2.131702
2013-01-03  0.773102  0.078984 -1.731036  0.420933

### For slicing columns explicitly:

In [105]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  1.068021  0.151068
2013-01-02 -0.856653  0.000226
2013-01-03  0.078984 -1.731036
2013-01-04 -1.593280 -0.158449
2013-01-05  0.175822  0.696630
2013-01-06  0.445324 -0.357431

### For getting a value explicitly:

In [106]:
df.iloc[1,1]

-0.8566533399230499

### For getting fast access to a scalar (equivalent to the prior method):

In [107]:
df.iat[1,1]

-0.8566533399230499

## Boolean indexing

### Using a single column's values to select data:

In [108]:
df["A"] > 0

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04     True
2013-01-05     True
2013-01-06    False
Freq: D, Name: A, dtype: bool

In [109]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-03  0.773102  0.078984 -1.731036  0.420933
2013-01-04  0.522558 -1.593280 -0.158449 -1.632815
2013-01-05  0.013442  0.175822  0.696630  0.423300

### Selecting valeus from a DataFrame where a boolean condition is met:

In [110]:
df>0

                A      B      C      D
2013-01-01  False   True   True  False
2013-01-02  False  False   True   True
2013-01-03   True   True  False   True
2013-01-04   True  False  False  False
2013-01-05   True   True   True   True
2013-01-06  False   True  False  False

In [111]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  1.068021  0.151068       NaN
2013-01-02       NaN       NaN  0.000226  2.131702
2013-01-03  0.773102  0.078984       NaN  0.420933
2013-01-04  0.522558       NaN       NaN       NaN
2013-01-05  0.013442  0.175822  0.696630  0.423300
2013-01-06       NaN  0.445324       NaN       NaN

### Using the isin() method for filtering:

In [112]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01 -0.554931  1.068021  0.151068 -1.115212    one
2013-01-02 -0.567171 -0.856653  0.000226  2.131702    one
2013-01-03  0.773102  0.078984 -1.731036  0.420933    two
2013-01-04  0.522558 -1.593280 -0.158449 -1.632815  three
2013-01-05  0.013442  0.175822  0.696630  0.423300   four
2013-01-06 -1.204969  0.445324 -0.357431 -2.375015  three

In [113]:
df2["E"].isin(["two", "four"])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [114]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  0.773102  0.078984 -1.731036  0.420933   two
2013-01-05  0.013442  0.175822  0.696630  0.423300  four

## Setting

### Setting a new column automatically aligns the data by the indexes:

In [115]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range("20130101", periods=6))
s1

2013-01-01    1
2013-01-02    2
2013-01-03    3
2013-01-04    4
2013-01-05    5
2013-01-06    6
Freq: D, dtype: int64

In [116]:
df["F"] = s1
df

                   A         B         C         D  F
2013-01-01 -0.554931  1.068021  0.151068 -1.115212  1
2013-01-02 -0.567171 -0.856653  0.000226  2.131702  2
2013-01-03  0.773102  0.078984 -1.731036  0.420933  3
2013-01-04  0.522558 -1.593280 -0.158449 -1.632815  4
2013-01-05  0.013442  0.175822  0.696630  0.423300  5
2013-01-06 -1.204969  0.445324 -0.357431 -2.375015  6

### Setting values by label:

In [117]:
df.at[dates[2], "A"] = 0
df

                   A         B         C         D  F
2013-01-01 -0.554931  1.068021  0.151068 -1.115212  1
2013-01-02 -0.567171 -0.856653  0.000226  2.131702  2
2013-01-03  0.000000  0.078984 -1.731036  0.420933  3
2013-01-04  0.522558 -1.593280 -0.158449 -1.632815  4
2013-01-05  0.013442  0.175822  0.696630  0.423300  5
2013-01-06 -1.204969  0.445324 -0.357431 -2.375015  6

### Setting value by position:

In [118]:
df.iat[3,0] = 0
df

                   A         B         C         D  F
2013-01-01 -0.554931  1.068021  0.151068 -1.115212  1
2013-01-02 -0.567171 -0.856653  0.000226  2.131702  2
2013-01-03  0.000000  0.078984 -1.731036  0.420933  3
2013-01-04  0.000000 -1.593280 -0.158449 -1.632815  4
2013-01-05  0.013442  0.175822  0.696630  0.423300  5
2013-01-06 -1.204969  0.445324 -0.357431 -2.375015  6

### Setting by assing with a NumPy arrary:

In [119]:
df.loc[:, "D"] = np.array([5]*len(df))
df

                   A         B         C  D  F
2013-01-01 -0.554931  1.068021  0.151068  5  1
2013-01-02 -0.567171 -0.856653  0.000226  5  2
2013-01-03  0.000000  0.078984 -1.731036  5  3
2013-01-04  0.000000 -1.593280 -0.158449  5  4
2013-01-05  0.013442  0.175822  0.696630  5  5
2013-01-06 -1.204969  0.445324 -0.357431  5  6

In [120]:
len(df)

6

In [121]:
df2 = df.copy()
df2

                   A         B         C  D  F
2013-01-01 -0.554931  1.068021  0.151068  5  1
2013-01-02 -0.567171 -0.856653  0.000226  5  2
2013-01-03  0.000000  0.078984 -1.731036  5  3
2013-01-04  0.000000 -1.593280 -0.158449  5  4
2013-01-05  0.013442  0.175822  0.696630  5  5
2013-01-06 -1.204969  0.445324 -0.357431  5  6

In [122]:
df2[df2 > 0]

                   A         B         C  D  F
2013-01-01       NaN  1.068021  0.151068  5  1
2013-01-02       NaN       NaN  0.000226  5  2
2013-01-03       NaN  0.078984       NaN  5  3
2013-01-04       NaN       NaN       NaN  5  4
2013-01-05  0.013442  0.175822  0.696630  5  5
2013-01-06       NaN  0.445324       NaN  5  6

In [123]:
-df2

                   A         B         C    D    F
2013-01-01  0.554931 -1.068021 -0.151068 -5.0 -1.0
2013-01-02  0.567171  0.856653 -0.000226 -5.0 -2.0
2013-01-03 -0.000000 -0.078984  1.731036 -5.0 -3.0
2013-01-04 -0.000000  1.593280  0.158449 -5.0 -4.0
2013-01-05 -0.013442 -0.175822 -0.696630 -5.0 -5.0
2013-01-06  1.204969 -0.445324  0.357431 -5.0 -6.0

In [124]:
df2[df2 > 0] = -df2
df2

                   A         B         C  D  F
2013-01-01 -0.554931 -1.068021 -0.151068 -5 -1
2013-01-02 -0.567171 -0.856653 -0.000226 -5 -2
2013-01-03  0.000000 -0.078984 -1.731036 -5 -3
2013-01-04  0.000000 -1.593280 -0.158449 -5 -4
2013-01-05 -0.013442 -0.175822 -0.696630 -5 -5
2013-01-06 -1.204969 -0.445324 -0.357431 -5 -6

# Missing data

### pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations.

### Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data:

In [125]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df1

                   A         B         C  D  F   E
2013-01-01 -0.554931  1.068021  0.151068  5  1 NaN
2013-01-02 -0.567171 -0.856653  0.000226  5  2 NaN
2013-01-03  0.000000  0.078984 -1.731036  5  3 NaN
2013-01-04  0.000000 -1.593280 -0.158449  5  4 NaN

In [126]:
df1.loc[dates[0]:dates[1], "E"] = 1
df1

                   A         B         C  D  F    E
2013-01-01 -0.554931  1.068021  0.151068  5  1  1.0
2013-01-02 -0.567171 -0.856653  0.000226  5  2  1.0
2013-01-03  0.000000  0.078984 -1.731036  5  3  NaN
2013-01-04  0.000000 -1.593280 -0.158449  5  4  NaN

### To drop any rows that have missing data:

In [127]:
df1.dropna(how="any")

                   A         B         C  D  F    E
2013-01-01 -0.554931  1.068021  0.151068  5  1  1.0
2013-01-02 -0.567171 -0.856653  0.000226  5  2  1.0

### Filling missing data:

In [128]:
df1.fillna(value=5)

                   A         B         C  D  F    E
2013-01-01 -0.554931  1.068021  0.151068  5  1  1.0
2013-01-02 -0.567171 -0.856653  0.000226  5  2  1.0
2013-01-03  0.000000  0.078984 -1.731036  5  3  5.0
2013-01-04  0.000000 -1.593280 -0.158449  5  4  5.0

In [129]:
df1.loc[:,["E"]].fillna(value=5)

              E
2013-01-01  1.0
2013-01-02  1.0
2013-01-03  5.0
2013-01-04  5.0

### To get the boolean mask where values are nan:

In [130]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False  False  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [131]:
df1.isna()

                A      B      C      D      F      E
2013-01-01  False  False  False  False  False  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Operations

## Stats

Operations in general exclude missing data

In [132]:
df.mean()

A   -0.385605
B   -0.113630
C   -0.233165
D    5.000000
F    3.500000
dtype: float64

### Same operation on the other axis:

In [133]:
df.mean(1)

2013-01-01    1.332832
2013-01-02    1.115280
2013-01-03    1.269590
2013-01-04    1.449654
2013-01-05    2.177179
2013-01-06    1.976585
Freq: D, dtype: float64

### Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specific dimention:

In [134]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

### Subtract a list and Series by axis with operator version.

In [135]:
df.sub(s, axis="index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.000000 -0.921016 -2.731036  4.0  2.0
2013-01-04 -3.000000 -4.593280 -3.158449  2.0  1.0
2013-01-05 -4.986558 -4.824178 -4.303370  0.0  0.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [136]:
df.sub(s, axis=1)

,2013-01-01 00:00:00,2013-01-02 00:00:00,2013-01-03 00:00:00,2013-01-04 00:00:00,2013-01-05 00:00:00,2013-01-06 00:00:00,A,B,C,D,F
2013-01-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2013-01-02,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2013-01-03,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2013-01-04,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2013-01-05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2013-01-06,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Apply

In [137]:
df.apply(np.cumsum)

                   A         B         C   D   F
2013-01-01 -0.554931  1.068021  0.151068   5   1
2013-01-02 -1.122102  0.211368  0.151295  10   3
2013-01-03 -1.122102  0.290352 -1.579741  15   6
2013-01-04 -1.122102 -1.302927 -1.738189  20  10
2013-01-05 -1.108660 -1.127105 -1.041559  25  15
2013-01-06 -2.313629 -0.681781 -1.398990  30  21

In [138]:
df_score = pd.DataFrame({"L":[51,65,78], "M":[80,90,100]}, index=["A", "B", "C"])
df_score

    L    M
A  51   80
B  65   90
C  78  100

In [141]:
df_score.apply(np.average, axis=0)

L    64.666667
M    90.000000
dtype: float64

In [142]:
df_score.apply(np.average, axis=1)

A    65.5
B    77.5
C    89.0
dtype: float64

In [148]:
df

                   A         B         C  D  F
2013-01-01 -0.554931  1.068021  0.151068  5  1
2013-01-02 -0.567171 -0.856653  0.000226  5  2
2013-01-03  0.000000  0.078984 -1.731036  5  3
2013-01-04  0.000000 -1.593280 -0.158449  5  4
2013-01-05  0.013442  0.175822  0.696630  5  5
2013-01-06 -1.204969  0.445324 -0.357431  5  6

In [146]:
df.apply(lambda x: x.max() - x.min())

A    1.218412
B    2.661301
C    2.427666
D    0.000000
F    5.000000
dtype: float64

## Histogramming